IlleniumDillon/MM32LLD/MM32/Sfr/MM32_RegBase.h
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2022-10-30 13:43:27
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2022-10-31 20:07:37
 * @FilePath: \CODE\MM32\Sfr\MM32_RegBase.h
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
#ifndef _MM32_REGBASE_H_
#define _MM32_REGBASE_H_

#define TIM2_BASE			(0x40000000)

#define TIM3_BASE			(0x40000400)

#define TIM4_BASE			(0x40000800)

#define TIM5_BASE			(0x40000C00)

#define TIM6_BASE			(0x40001000)

#define TIM7_BASE			(0x40001400)

#define RTC_BKP_BASE			(0x40002800)

#define WWDG_BASE			(0x40002C00)

#define IWDG_BASE			(0x40003000)

#define SPI2_BASE			(0x40003800)

#define SPI3_BASE			(0x40003C00)

#define UART2_BASE			(0x40004400)

#define UART3_BASE			(0x40004800)

#define UART4_BASE			(0x40004C00)

#define UART5_BASE			(0x40005000)

#define I2C1_BASE			(0x40005400)

#define I2C2_BASE			(0x40005800)

#define CAN_BASE			(0x40006400)

#define CRS_BASE			(0x40006C00)

#define PWR_BASE			(0x40007000)

#define DAC_BASE			(0x40007400)

#define UART7_BASE			(0x40007800)

#define UART8_BASE			(0x40007C00)

#define SYSCFG_BASE			(0x40010000)

#define EXTI_BASE			(0x40010400)

#define ADC1_BASE			(0x40012400)

#define ADC2_BASE			(0x40012800)

#define TIM1_BASE			(0x40012C00)

#define SPI1_BASE			(0x40013000)

#define TIM8_BASE			(0x40013400)

#define UART1_BASE			(0x40013800)

#define UART6_BASE			(0x40013C00)

#define COMP_BASE			(0x40014000)

#define ADC3_BASE			(0x40014C00)

#define SDIO_BASE			(0x40018000)

#define DMA1_BASE			(0x40020000)

#define DMA2_BASE			(0x40020400)

#define RCC_BASE			(0x40021000)

#define FLASH_BASE			(0x40022000)

#define CRC_BASE			(0x40023000)

#define GPIOA_BASE			(0x40040000)

#define GPIOB_BASE			(0x40040400)

#define GPIOC_BASE			(0x40040800)

#define GPIOD_BASE			(0x40040C00)

#define GPIOE_BASE			(0x40041000)

#define GPIOF_BASE			(0x40041400)

#define GPIOG_BASE			(0x40041800)

#define GPIOH_BASE			(0x40041C00)

#define USB_BASE			(0x50000000)

#define FSMC_BASE			(0xA0000000)

#endif
